{
  "categories": [
    {
      "id": "introduction",
      "title": "引言"
    },
    {
      "id": "writer-quality",
      "title": "主体素质建构"
    },
    {
      "id": "writing-technique",
      "title": "写作技法构思"
    },
    {
      "id": "language-usage",
      "title": "写作语言应用"
    },
    {
      "id": "revision-guide",
      "title": "作文修改建议"
    }
  ],
  "items": {
    "introduction": [],
    "writer-quality": [
      {
        "id": "1",
        "source": "《序志》",
        "originalText": "夫“文心”者，言为文之用心也。昔涓子《琴心》，王孙《巧心》，心哉美矣夫，故用之焉。古来文章，以雕缛成体，岂取驺之群言雕龙也。",
        "translation": "所谓“文心”，说的是做文章怎样用心。从前涓子著有《琴心》，王孙著有《巧心》，可见心是非常美好、灵巧的呀，所以就用它来做书的名称了。自古以来的文章，都是精雕细刻写成的，难道是采取驺用雕镂龙纹似的手段来修饰语言吗？",
        "analysis": "写文章需要用心，一方面是思考，一方面是雕琢语言，有关这两点，《文心雕龙》做了详细的探讨。"
      },
      {
        "id": "2",
        "source": "《原道》",
        "originalText": "文之为德也大矣，与天地并生者，何哉？",
        "translation": "“文”作为万物皆有的属性和形式表现，其渊源是多么深广啊，试想与天地一块产生的东西是什么呢？",
        "analysis": "强调文章的综合属性和写作的社会责任，树立“文以载道”的创作观，重视文章的思想价值。"
      },
      {
        "id": "10",
        "source": "《知音》",
        "originalText": "夫缀文者情动而辞发，观文者披辞以入情，沿波讨源，虽幽必显。",
        "translation": "作者是先有了思想感情才写文章，读者是先阅读文章然后才了解作者的思想感情。沿着河流追溯根源，即使隐微也一定会显现出来。",
        "analysis": "此句强调了文学作品的双向性：一方面，作家在创作时会被感情所驱动，通过用词和句式表达出内在情感；另一方面，读者通过阅读文章来理解作者所要表达的情感和意义，甚至通过深入思考和探索来找到文章的源头，真正领悟作者想要传达的信息。刘勰强调真情实感是写作的源动力，反对无病呻吟的写作态度。"
      },
      {
        "id": "19",
        "source": "《时序》",
        "originalText": "故知文变染乎世情，兴废系乎时序，原始以要终，虽百世可知也。",
        "translation": "所以知道文章的变化受到时代情况的感染，不同文体的兴衰和时代的兴衰有关，探究它的开始，总归它的终结，即使是百世的文学流变也是可以推知的。",
        "analysis": "写作需要关注当下的时代属性，将当下的时代所发生的融入文学之众。"
      }
    ],
    "writing-technique": [
      {
        "id": "4",
        "source": "《知音》",
        "originalText": "凡操千曲而后晓声，观千剑而后识器。",
        "translation": "弹奏千首乐曲才能通晓音律，观察千柄宝剑才能识别兵器。",
        "analysis": "强调积累的重要性，鼓励学生通过广泛阅读和写作实践提升写作能力。"
      },
      {
        "id": "5",
        "source": "《神思》",
        "originalText": "意授于思，言授于意，密则无际，疏则千里。",
        "translation": "意象的形成是由于构思的作用，语言文辞表现的则是意象，意、思、言这三者密合时天衣无缝，疏漏时则又相隔千里。",
        "analysis": "揭示“思想-立意-表达”的创作链条，在写作时先明确中心思想再组织语言，"
      },
      {
        "id": "8",
        "source": "《书记》",
        "originalText": "随事立体，贵乎精要。意少一字则义阙，句长一言则辞妨。",
        "translation": "根据情况来确立体式，表达贵在精练扼要。文意少一字就有缺漏，句子多一字就妨害文辞。",
        "analysis": "注意文体与所表达内容的适配性，根据表达内容选择合适的问题。"
      },
      {
        "id": "11",
        "source": "《神思》",
        "originalText": "是以临篇缀虑，必有二患：理郁者苦贫，辞溺者伤乱。然则博见为馈贫之粮，贯一为拯乱之药，博而能一，亦有助乎心力矣。",
        "translation": "所以构思作文，连缀成篇，必定要遇到两种困难：理路文思郁滞不通的人苦于学识的贫乏；沉溺于言辞的人则感到文理的杂乱。然而广博的见闻，是补充知识贫乏的粮食，贯穿集中则是拯救思理杂乱的药物，如果有了广博的学识，又能贯穿集中，使“万涂归一”，那对为文用思是大有助益的。",
        "analysis": "刘勰介绍了写作必然会遇见的两种困难，这两种困难可以用广博的见识和集中的精神来解决。学生在作文写作的修习中既需要不断积累，有需要保持集中。"
      },
      {
        "id": "12",
        "source": "《定势》",
        "originalText": "夫情致异区，文变殊术，莫不因情立体，即体成势也。势者，乘利而为制也。如机发矢直，涧曲湍回，自然之趣也。圆者规体，其势也自转；方者矩形，其势也自安。文章体势，如斯而已。是以模经为式者，自入典雅之懿；效《骚》命篇者，必归艳逸之华；综意浅切者，类乏酝藉；断辞辨约者，率乖繁缛。譬激水不漪，槁木无阴，自然之势也。",
        "translation": "作者的思想感情不同，写文章的原则和方法也多有变化，没有不是根据作者的情思来确定文章的体裁，再借助于体裁来形成文章的基本格调的。所谓势，是乘借有利条件而成的一种格调。如同机弩扳发，箭就直线射出；山涧曲折，急流也就有回旋，这是自然的趋势。圆形的物体是圆规形的，它的态势自然趋向于转动；方形的物体是矩形的，它的状貌自然是稳定的。文章的体裁和格调，就像是这样的罢了。因此，以模仿经书写出的文章，自然具有典雅之美；仿效以《离骚》为代表的楚辞布局谋篇，则必定显出华美、艳丽的辞采；立意浅显切近的，大都不够含蓄、深刻；措辞明晰简要的，则多没有繁富的文采。就像激流不会出现涟漪，枯树不会有密叶浓荫，这是自然的态势。",
        "analysis": "刘勰揭示了文章情感、体裁和格调之间的内在关系，并解释了了文章的“势”。在写作中，可以利用这种内在关系，同时遵循自然的“势”，使得文章表达合情合理。"
      },
      {
        "id": "13",
        "source": "《总术》",
        "originalText": "文场笔苑，有术有门。务先大体，鉴必穷源。乘一总万，举要治繁。思无定契，理有恒存。",
        "translation": "在文章写作的园地里，是有规律、方法和门径的。一定要先掌握写作的基本要领，学习、借鉴则一定要追溯本源。掌握规律以驾驭千变万化，突出要义而梳理纷繁。文思虽没有一定之规，写作的原理则是恒久不变的。",
        "analysis": "写作文不是简单的文字堆砌和凭感觉，而是在系统学习之后把握写作的内在逻辑，规范而真实的表达。"
      },
      {
        "id": "15",
        "source": "《章句》",
        "originalText": "夫裁文匠笔，篇有大小；离章合句，调有缓急；随变适会，莫见定准。句司数字，待相接以为用；章总一义，须意穷而成体。其控引情理，送迎际会，譬舞容回环，而有缀兆之位；歌声靡曼，而有抗坠之节也。",
        "translation": "人们写作有韵或无韵的文章，篇制有大有小；分别章节联结句子，声调有缓有急；要随着文情的变化适当调配，而没有固定的标准。句子掌管着几个字，必须组合起来才能发挥作用；章节总括着一个意思，必须把它说透才能形成一个整体。章节联系着情理的表达，应当迎上送下有分有合，好比舞蹈的态势，回旋环绕，要有一定的行列和位置；又如唱歌的声音，婉转柔长，要有高亢和低沉的节奏。",
        "analysis": "在日常的写作中，要有意识地根据文章的内容和题材处理文章内部的章节和字词的关系，使得表达顺畅。"
      },
      {
        "id": "17",
        "source": "《物色》",
        "originalText": "山沓水匝，树杂云合。目既往还，心亦吐纳。春日迟迟，秋风飒飒。情往似赠，兴来如答。",
        "translation": "山峦重叠，流水环绕，绿树丛生，白云聚合。诗人的眼目反复观察这些景物，内心也就有所感受而要抒发。春阳舒暖柔和，秋风萧瑟凉爽。诗人以情观物，就像给友人临别赠言一样，寄意无穷，感应深切；景物触发作者的感兴，恍如酬答知音一般，文思泉涌，风光无限。",
        "analysis": "文学创作的灵感不是空想来的，必须要创作者有意识地和外在的事物交互，形成独到的什么体验，自然会引发感兴。"
      }
    ],
    "language-usage": [
      {
        "id": "3",
        "source": "《情采》",
        "originalText": "故情者文之经，辞者理之纬；经正而后纬成，理定而后辞畅。",
        "translation": "所以说情理是文章的经线，文辞则是情理的纬线；经线端直纬线才能与其交织相成，情理明确文辞才能畅朗。",
        "analysis": "写作文必须兼顾情理的表达和对于语言文辞的考究，刘勰二者兼顾是文章创作的根本。"
      },
      {
        "id": "6",
        "source": "《熔裁》",
        "originalText": "句有可削，足见其疏；字不得减，乃知其密。",
        "translation": "句子有可删削之处，足以看出表达的粗疏；文字不能再减少，才知道文辞的精密。",
        "analysis": "在日常的写作中，注意语言的凝练属性，养成删改锤锻作文的习惯。"
      },
      {
        "id": "7",
        "source": "《夸饰》",
        "originalText": "然饰穷其要，则心声锋起；夸过其理，则名实两乖。若能酌《诗》、《书》之旷旨，翦扬、马之甚泰，使夸而有节，饰而不诬，亦可谓之懿也。",
        "translation": "然而如果使夸饰穷尽事理之要，那么就会显现出思想感情的光辉；如果夸饰得过于违背事理，那就会使文辞与实际两相背离了。如果能够酌取《诗经》、《尚书》的广博、深刻的意旨，剪除扬雄、司马相如过分的夸张，做到夸张而有节制，修饰而不悖事理，也就可以说是美好的了。",
        "analysis": "使用修辞手法时把握分寸，避免过度渲染导致失真，以突出文章所表达的思想感情的纯粹和有理据。"
      },
      {
        "id": "14",
        "source": "《宗经》",
        "originalText": "辞约而旨丰，事近而喻远。",
        "translation": "言辞简约而旨意丰富，取事浅近而喻理深远",
        "analysis": "这是刘勰对于五经（《诗经》《尚书》《尔雅》《春秋》《礼记》）共同写作特征的描述，对于日常写作的启示是，用简洁语言表达深刻思想，善用生活化事例说明抽象道理。"
      },
      {
        "id": "16",
        "source": "《议对》",
        "originalText": "文以辨洁为能，不以繁缛为巧；事以明核为美，不以环隐为奇。",
        "translation": "文章以明辨洁净为尚，不以繁文缛采为巧；事义以明晰扼要为美，不以曲折隐晦为奇",
        "analysis": "这是刘勰对于议政文章的创作特征评述，在中学阶段议论文的写作中对于当下时政的表达应该清晰明了，合乎逻辑，避免杂乱堆砌和隐晦表达。"
      }
    ],
    "revision-guide": [
      {
        "id": "9",
        "source": "《熔裁》",
        "originalText": "规范本体谓之熔，剪裁浮辞谓之裁。裁则芜秽不生，熔则纲领昭畅，譬绳墨之审分，斧斤之斫削矣。",
        "translation": "按照一定的规范调整文章的思想内容，推敲、修正文辞运用的缺陷。使文章的思想内容合乎文章体制的规范，叫做熔；删削多余的、无实用价值的文辞，叫做裁。经过剪裁，文辞不再繁冗拖沓，经过熔范，则体制分明，旨要突出，犹如在木料上打好墨线作为标准，再用斧头砍掉多余的部分一样。",
        "analysis": "刘勰用比喻的手法描述了写文章修订的过程，通过对于对于文章语言文辞的修订和整体发精简以达到体制分明，旨要突出的最终目的。"
      },
      {
        "id": "18",
        "source": "《熔裁》",
        "originalText": "夫百节成体，共资荣卫；万趣会文，不离辞情。若情周而不繁，辞运而不滥，非夫熔裁，何以行之乎？",
        "translation": "成百的骨节构成人体，共同依靠血脉的流通；多种意趣汇聚成文章，离不开文辞和情思。若要情感表达得充分而又不繁杂，文辞运用得完美而不泛滥，不发挥熔裁的作用，怎么能做得到呢？",
        "analysis": "文章创作需要整合，单一优秀要素的胡乱堆砌是出不了好文章的，刘勰认为就像是人体有骨节组成但是需要血脉链接，所以写作文必须要熔裁（规范和删节文辞，以达到整体合适的表达）的作用。"
      }
    ]
  }
}